src/InformationRegisters/ГП_СчетчикиБП77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГП_СчетчикиБП77</Name>
			<Comment>// Гарант+</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетчикНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСчетчикаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПоверки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПересчета</Name>
					<Comment>Коэффициент пересчета в кубометры</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйПоказатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСчетчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаХВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаГВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаКан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоДляКанализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначенияПоказаний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КонтрагентИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАбонентаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>85</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетчикаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоказаний</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБудущейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КонтрагентКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАбонентаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетчикКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КВП_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГП_УслугиБП77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГП_УслугиБП77</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодРасчетаХВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаГВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаКан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоДляКанализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентХВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентГВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбъектАбонентаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КонтрагентКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАбонентаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КВП_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГП_ПоказанияСчетчиковБП77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГП_ПоказанияСчетчиковБП77</Name>
			<Comment>// Гарант+  [F00226318] Заполнение документов Установка счетчика</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КонтрагентКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАбонентаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетчикКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ГП_МиграцияПриборовУчета/Ext/Module.bsl
// Гарант+ Килипенко 22.07.2024 [F00226285] заполнение назначения услуг ++
#Область ПрограммныйИнтерфейс

#Область Счетчики

// Формирует составной код справочника по данным счетчика из БП77
// Параметры:
//  КонтрагентКод - Строка
//  ОбъектАбонентаКод - Строка
//  СчетчикКод - Строка
// Возвращаемое значение:
//  - Строка - Составной код вида: xxxxxxxx-xxxx-xxx (КонтрагентКод{8}-ОбъектАбонентаКод{4}-СчетчикКод{3})
Функция СформироватьСоставнойКодСчетчикаБП77(Знач КонтрагентКод, Знач ОбъектАбонентаКод, Знач СчетчикКод) Экспорт
    НаправлениеДополнения = "Слева";
    СимволДополнения = "0";

    Возврат СтрШаблон("%1-%2-%3",
        СтроковыеФункцииКлиентСервер.ДополнитьСтроку(
            КонтрагентКод, ПолучитьДлинуКодаКонтрагентаБП77(), СимволДополнения, НаправлениеДополнения),
        СтроковыеФункцииКлиентСервер.ДополнитьСтроку(
            ОбъектАбонентаКод, ПолучитьДлинуКодаОбъектаАбонентаБП77(), СимволДополнения, НаправлениеДополнения),
        СтроковыеФункцииКлиентСервер.ДополнитьСтроку(
            СчетчикКод, ПолучитьДлинуКодаСчетчикаБП77(), СимволДополнения, НаправлениеДополнения));
КонецФункции

// Выполняет разбор составного кода счетчика (идентификатора БП77)
// Параметры:
//  Счетчик - СправочникСсылка.КВП_Счетчики, СправочникОбъект.КВП_Счетчики
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КонтрагентКод - Строка
//      * ОбъектАбонентаКод - Строка
//      * СчетчикКод - Строка
Функция ПолучитьЧастиСоставногоКодаСчетчика(Знач Счетчик) Экспорт
    РезультатФункции = Новый Структура("Успех, КонтрагентКод, ОбъектАбонентаКод, СчетчикКод", Истина, "", "", "");

    Если ТипЗнч(Счетчик) <> Тип("СправочникСсылка.КВП_Счетчики")
        И ТипЗнч(Счетчик) <> Тип("СправочникОбъект.КВП_Счетчики") Тогда
        Возврат РезультатФункции; // неверный тип счетчика
    КонецЕсли;

    ИдентификаторСчетчикаБП77 = Неопределено;

    Если ТипЗнч(Счетчик) = Тип("СправочникСсылка.КВП_Счетчики") Тогда
        Если Счетчик.Пустая() Тогда
            Возврат РезультатФункции; // нет данных идентификатора
        КонецЕсли;

        ИдентификаторСчетчикаБП77 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счетчик, "ГП_ИдентификаторБП77");
    Иначе
        ИдентификаторСчетчикаБП77 = Счетчик.ГП_ИдентификаторБП77;
    КонецЕсли;

    Если ТипЗнч(ИдентификаторСчетчикаБП77) <> Тип("Строка") ИЛИ ПустаяСтрока(ИдентификаторСчетчикаБП77) Тогда
        Возврат РезультатФункции; // нет данных идентификатора
    КонецЕсли;

    РезультатФункции = ПолучитьЧастиСоставногоКодаСчетчикаПоИдентификатору(ИдентификаторСчетчикаБП77);
    Возврат РезультатФункции;
КонецФункции

// Выполняет разбор составного кода счетчика (идентификатора БП77)
// Параметры:
//  ИдентификаторСчетчикаБП77 - Строка - Составной код счетчика
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КонтрагентКод - Строка
//      * ОбъектАбонентаКод - Строка
//      * СчетчикКод - Строка
Функция ПолучитьЧастиСоставногоКодаСчетчикаПоИдентификатору(Знач ИдентификаторСчетчикаБП77) Экспорт
    РезультатФункции = Новый Структура("Успех, КонтрагентКод, ОбъектАбонентаКод, СчетчикКод", Истина, "", "", "");

    ШаблонРазбораКода = ПолучитьШаблонПоискаЧастейИдентификатораСчетчика();
    РезультатПоискаЧастей = СтрНайтиПоРегулярномуВыражению(ИдентификаторСчетчикаБП77, ШаблонРазбораКода);
    Если РезультатПоискаЧастей.НачальнаяПозиция = 0
        ИЛИ РезультатПоискаЧастей.ПолучитьГруппы().Количество() < ПолучитьУровеньВложенностиКодаСчетчикаБП77() Тогда

        РезультатФункции.Успех = Ложь;
        Возврат РезультатФункции; // Совпадений не найдено
    КонецЕсли;

    МассивЧастейНомера = РезультатПоискаЧастей.ПолучитьГруппы();
    РезультатФункции.КонтрагентКод = МассивЧастейНомера[0].Значение;
    РезультатФункции.ОбъектАбонентаКод = МассивЧастейНомера[1].Значение;
    РезультатФункции.СчетчикКод = МассивЧастейНомера[2].Значение;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  КоличествоМесяцев - Число - Количество месяцев периодичности поверки
// Возвращаемое значение:
//  - ПеречислениеСсылка.УПЖКХ_МежпроверочныеИнтервалыСчетчиков, Неопределено
Функция ПолучитьМежпроверочныйИнтервалПериодичности(Знач КоличествоМесяцев) Экспорт
    КоличествоЛет = Цел(КоличествоМесяцев / 12);
    Если КоличествоЛет < 1 ИЛИ КоличествоЛет > 20 Тогда
        Возврат Неопределено;
    КонецЕсли;

    ЛетПрописью = ЧислоПрописью(КоличествоЛет, "Л = ru_RU; НП = Ложь; НД = Ложь", ", , , м, , , , , 0");
    Если КоличествоЛет = 1 Тогда
        ЛетПрописью = ЛетПрописью + "Год";
    ИначеЕсли КоличествоЛет <= 4 Тогда
        ЛетПрописью = ЛетПрописью + "Года";
    ИначеЕсли КоличествоЛет <= 20 Тогда
        ЛетПрописью = ЛетПрописью + "Лет";
    КонецЕсли;

    Возврат Перечисления.УПЖКХ_МежпроверочныеИнтервалыСчетчиков[ЛетПрописью];
КонецФункции

#КонецОбласти // Счетчики

#Область КонстантыСчетчиков

// Возвращаемое значение:
//  - Число
Функция ПолучитьДлинуКодаКонтрагентаБП77() Экспорт
    Возврат 8;
КонецФункции

// Возвращаемое значение:
//  - Число
Функция ПолучитьДлинуКодаОбъектаАбонентаБП77() Экспорт
    Возврат 4;
КонецФункции

// Возвращаемое значение:
//  - Число
Функция ПолучитьДлинуКодаСчетчикаБП77() Экспорт
    Возврат 3;
КонецФункции

// Возвращаемое значение:
//  - Число
Функция ПолучитьУровеньВложенностиКодаСчетчикаБП77() Экспорт
    Возврат 3;
КонецФункции

// Маска идентификатора счетчика БП77 для использования в функции подобно
// Возвращаемое значение:
//  - Строка
Функция ПолучитьМаскуСоставногоКодаСчетчикаДляПодобно() Экспорт
    Возврат "________-____-___";
КонецФункции

// Получает шаблон для проверки валидности идентификатора (составного кода) счетчика БП77
// Возвращаемое значение:
//  - Строка
Функция ПолучитьШаблонПроверкиСоставногоКодаСчетчика() Экспорт
    РезультатФункции = ПолучитьШаблонПоискаЧастейИдентификатораСчетчика();
    РезультатФункции = СтрЗаменитьПоРегулярномуВыражению(РезультатФункции, "[\)\(]", "");
    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ТолькоЗначащие - Булево - Если Истина, тогда ведущие нули будут игнорироваться
// Возвращаемое значение:
//  - Строка
Функция ПолучитьШаблонПоискаЧастейИдентификатораСчетчика(Знач ТолькоЗначащие = Ложь) Экспорт
    Если ТолькоЗначащие Тогда
        Возврат "0*([1-9][0-9]{0,7})-0*([1-9][0-9]{0,3})-0*([1-9][0-9]{0,2})";
    Иначе
        Возврат "([0-9]{8})-([0-9]{4})-([0-9]{3})";
    КонецЕсли;
КонецФункции

// Устарела. Не используется в текущей реализации
//
// Параметры:
//  КакСписокСРазделителем - Булево
// Возвращаемое значение:
//  - Массив из Строка, Строка
Функция ПолучитьКлючиДанныхСчетчикаБП77(Знач КакСписокСРазделителем = Ложь) Экспорт
    РезультатФункции = Новый Массив;
    РезультатФункции.Добавить("КонтрагентКод");
    РезультатФункции.Добавить("КонтрагентПолноеНаименование");
    РезультатФункции.Добавить("КонтрагентНаименование");
    РезультатФункции.Добавить("КонтрагентИНН");
    РезультатФункции.Добавить("ОбъектАбонентаНаименование");
    РезультатФункции.Добавить("ОбъектАбонентаКод");
    РезультатФункции.Добавить("ДоговорНаименование");
    РезультатФункции.Добавить("ДоговорКод");
    РезультатФункции.Добавить("СчетчикНаименование");
    РезультатФункции.Добавить("СчетчикКод");
    РезультатФункции.Добавить("ТипСчетчикаНаименование");
    РезультатФункции.Добавить("ТипСчетчикаКод");
    РезультатФункции.Добавить("ПериодичностьПоверки");
    РезультатФункции.Добавить("КоэффициентПересчета");
    РезультатФункции.Добавить("МаксимальныйПоказатель");
    РезультатФункции.Добавить("Комментарий");
    РезультатФункции.Добавить("ВидСчетчика");
    РезультатФункции.Добавить("МетодРасчетаХВ");
    РезультатФункции.Добавить("МетодРасчетаГВ");
    РезультатФункции.Добавить("МетодРасчетаКан");
    РезультатФункции.Добавить("ТолькоДляКанализации");
    РезультатФункции.Добавить("ДатаУстановки");
    РезультатФункции.Добавить("ДатаПоверки");
    РезультатФункции.Добавить("ДатаПоказаний");
    РезультатФункции.Добавить("ЗначенияПоказаний");

    Возврат РезультатФункции;
КонецФункции

// Возвращаемое значение:
//  - Соответствие
Функция ПолучитьСоответствиеКодовУслугСчетчиковБП77() Экспорт
    РезультатФункции = Новый Соответствие;

    РезультатФункции.Вставить("ХолоднаяВода", "00-001");
    РезультатФункции.Вставить("Счетчик ХВ (Подогрев)", "00-002");
    РезультатФункции.Вставить("ПодогревХВ", "00-002");
    РезультатФункции.Вставить("ГорячаяВода", "00-003");
    РезультатФункции.Вставить("ГорячаяВодаВход", "00-003");
    РезультатФункции.Вставить("ГорячаяВодаВыход", "00-003");
    РезультатФункции.Вставить("Канализация", "00-004");
    // Холодное водоснабжение (для расчета ВО)
    //  Дополнение к ТЗ для ХВ с признаком ТолькоДляКанализации
    РезультатФункции.Вставить("ХолоднаяВодаВодоотвод", "00-005");
    РезультатФункции.Вставить("НегативноеВоздействие", "00-006");

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // КонстантыСчетчиков

#Область ЛицевыеСчета

// Формирует составной код справочника по данным счетчика из БП77
// Параметры:
//  КонтрагентКод - Строка
//  ОбъектАбонентаКод - Строка
// Возвращаемое значение:
//  - Строка - Составной код вида: xxxxxxxx-xxxx (КонтрагентКод{8}-ОбъектАбонентаКод{4})
Функция СформироватьСоставнойКодЛицевогоСчетаБП77(Знач КонтрагентКод, Знач ОбъектАбонентаКод) Экспорт
    НаправлениеДополнения = "Слева";
    СимволДополнения = "0";

    Возврат СтрШаблон("%1-%2",
        СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КонтрагентКод, 8, СимволДополнения, НаправлениеДополнения),
        СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ОбъектАбонентаКод, 4, СимволДополнения, НаправлениеДополнения));
КонецФункции

// Устарела. В дальнейшем развитии функционала миграции использоваться не будет.
//  Код для сопоставления с БП77 будет формироваться в виде xxxxxxxx{8}-xxxx{4} КонтрагентКод-ОбъектАбонентаКод
//  и будет записан в реквизит лицевого счета `ГП_ИдентификаторБП77`
//
// Выполняет разбор составного кода идентификатора (созданного по данным кодов БП77) вида x_xxxxxxxx
//  Идентификатор формировался не ГП по данным: ОбъектАбонентаКод_КонтрагентКод
// Параметры:
//  УстаревшийСоставнойКодБП77 - Строка - Составной код лицевого счета вида x{1,4}_xxxxxxxx{8} ОбъектАбонентаКод_КонтрагентКод
// Возвращаемое значение:
//  - Структура
Функция ПолучитьЧастиИдентификатораКодаЛицевогоСчета(Знач УстаревшийСоставнойКодБП77) Экспорт
    РезультатФункции = Новый Структура("Успех, КонтрагентКод, ОбъектАбонентаКод", Истина, "", "");

    ШаблонРазбораКода = "([0-9]{1,4})_([0-9]{8})";
    РезультатПоискаЧастей = СтрНайтиПоРегулярномуВыражению(УстаревшийСоставнойКодБП77, ШаблонРазбораКода);
    Если РезультатПоискаЧастей.НачальнаяПозиция = 0 ИЛИ РезультатПоискаЧастей.ПолучитьГруппы().Количество() < 2 Тогда
        РезультатФункции.Успех = Ложь;
        Возврат РезультатФункции; // Совпадений не найдено
    КонецЕсли;

    МассивЧастейНомера = РезультатПоискаЧастей.ПолучитьГруппы();
    РезультатФункции.КонтрагентКод = МассивЧастейНомера[1].Значение;
    РезультатФункции.ОбъектАбонентаКод = МассивЧастейНомера[0].Значение;

    Возврат РезультатФункции;
КонецФункции

// Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика ++
//
// Получает таблицу счетчиков и лицевых счетов для заполнения документов Установка счетчиков
// Параметры:
//  ДатаАктуальности - Дата, Неопределено
// Возвращаемое значение:
//  - ТаблицаЗначений
//      * Счетчик - СправочникСсылка.КВП_Счетчики
//      * Услуга - СправочникСсылка.КВП_Услуги
//      * ЛицевойСчет - СправочникСсылка.КВП_ЛицевыеСчета
//      * ДатаПоверки - Дата
//      * ДатаБудущейПоверки - Дата
//      * ДатаУстановки - Дата
//      * Показание - Число
//      * ДатаПоказания - Дата
Функция ПолучитьДанныеДляУстановкиСчетчиков(Знач ДатаАктуальности = Неопределено) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ГП_СчетчикиБП77.Счетчик КАК Счетчик,
        |	ГП_СчетчикиБП77.Счетчик.ВидУслуги КАК Услуга,
        |	ГП_СчетчикиБП77.СчетчикКод КАК СчетчикКод,
        |	ГП_СчетчикиБП77.КонтрагентКод КАК КонтрагентКод,
        |	ГП_СчетчикиБП77.ОбъектАбонентаКод КАК ОбъектАбонентаКод,
        |	ГП_СчетчикиБП77.ДатаПоверки КАК ДатаПоверки,
        |	ГП_СчетчикиБП77.ДатаБудущейПоверки КАК ДатаБудущейПоверки,
        |	ГП_СчетчикиБП77.ДатаУстановки КАК ДатаУстановки
        |ПОМЕСТИТЬ ВТ_Счетчики
        |ИЗ
        |	РегистрСведений.ГП_СчетчикиБП77 КАК ГП_СчетчикиБП77
        |ГДЕ
        |	ГП_СчетчикиБП77.Счетчик <> &ПустаяСсылкаСчетчик
        |	// И ГП_СчетчикиБП77.Счетчик.Наименование <> """"
        |	И ГП_СчетчикиБП77.Счетчик.ГП_ИдентификаторБП77 ПОДОБНО &МаскаИдентификатораСчетчикаБП77
        |	И ГП_СчетчикиБП77.Счетчик.ПометкаУдаления = ЛОЖЬ
        |	// И ГП_СчетчикиБП77.ДатаУстановки <= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |// Счетчики лицевых счетов
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ВТ_Счетчики.Счетчик КАК Счетчик,
        |	ВТ_Счетчики.Услуга КАК Услуга,
        |	ВТ_Счетчики.ДатаПоверки КАК ДатаПоверки,
        |	ВТ_Счетчики.ДатаБудущейПоверки КАК ДатаБудущейПоверки,
        |	ВТ_Счетчики.ДатаУстановки КАК ДатаУстановки,
        |	ГП_УслугиБП77.ЛицевойСчет КАК ЛицевойСчет,
        |	ГП_ПоказанияСчетчиковБП77СрезПоследних.Показание КАК Показание,
        |	ГП_ПоказанияСчетчиковБП77СрезПоследних.Период КАК ДатаПоказания
        |ИЗ
        |	ВТ_Счетчики КАК ВТ_Счетчики
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГП_УслугиБП77 КАК ГП_УслугиБП77
        |		ПО ВТ_Счетчики.КонтрагентКод = ГП_УслугиБП77.КонтрагентКод
        |			И ВТ_Счетчики.ОбъектАбонентаКод = ГП_УслугиБП77.ОбъектАбонентаКод
        |			И (ГП_УслугиБП77.ЛицевойСчет <> &ПустаяСсылкаЛС)
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГП_ПоказанияСчетчиковБП77.СрезПоследних(&Период, ) КАК ГП_ПоказанияСчетчиковБП77СрезПоследних
        |		ПО ВТ_Счетчики.КонтрагентКод = ГП_ПоказанияСчетчиковБП77СрезПоследних.КонтрагентКод
        |			И ВТ_Счетчики.ОбъектАбонентаКод = ГП_ПоказанияСчетчиковБП77СрезПоследних.ОбъектАбонентаКод
        |			И ВТ_Счетчики.СчетчикКод = ГП_ПоказанияСчетчиковБП77СрезПоследних.СчетчикКод
        |
        |УПОРЯДОЧИТЬ ПО
        |	ГП_УслугиБП77.ЛицевойСчет,
        |	ВТ_Счетчики.ДатаУстановки,
        |	ВТ_Счетчики.ДатаПоверки
        |";

    Если ДатаАктуальности = Неопределено Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ГП_СчетчикиБП77.ДатаУстановки <= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)", "");
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Период", "");
    Иначе
        Запрос.УстановитьПараметр("Период", ДатаАктуальности);
    КонецЕсли;

    Запрос.УстановитьПараметр("ПустаяСсылкаЛС", Справочники.КВП_ЛицевыеСчета.ПустаяСсылка());
    Запрос.УстановитьПараметр("ПустаяСсылкаСчетчик", Справочники.КВП_Счетчики.ПустаяСсылка());
    Запрос.УстановитьПараметр("МаскаИдентификатораСчетчикаБП77", ПолучитьМаскуСоставногоКодаСчетчикаДляПодобно());

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();
    Возврат РезультатФункции;
КонецФункции // Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика --

#КонецОбласти // ЛицевыеСчета

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 22.07.2024 [F00226285] заполнение назначения услуг --
